{
  "irVersion": "1.0",
  "project": "omni-github",
  "repository": "https://github.com/plexusone/omni-github",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-07-05",
      "highlights": [
        { "description": "New `omniskill/github/` package with GitHub skill for AI agents" },
        { "description": "MkDocs documentation site with comprehensive guides" }
      ],
      "added": [
        { "description": "GitHub skill (`omniskill/github/`) implementing `skill.Skill` interface", "commit": "315cda3" },
        { "description": "10 tools: list_issues, get_issue, create_issue, update_issue, add_issue_comment, list_pull_requests, get_pull_request, add_pull_request_comment, search_code, search_issues", "commit": "315cda3" },
        { "description": "GitHub Enterprise support for skill via `BaseURL` config", "commit": "315cda3" },
        { "description": "Default owner/repo configuration for skill", "commit": "315cda3" }
      ],
      "documentation": [
        { "description": "MkDocs site with Material theme and PlexusOne navigation", "commit": "8b04e56" },
        { "description": "Storage provider documentation (overview, configuration, batch operations)", "commit": "8b04e56" },
        { "description": "Skills documentation (overview, GitHub skill with tool reference)", "commit": "8b04e56" },
        { "description": "Getting started guides (installation, quickstart)", "commit": "8b04e56" },
        { "description": "Update README as landing page for both packages", "commit": "ea8eab5" },
        { "description": "Update README shields", "commit": "786eede" }
      ],
      "dependencies": [
        { "description": "Add `github.com/plexusone/omniskill` v0.10.0 for skill interface", "commit": "fb36903" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-04-25",
      "highlights": [
        { "description": "Restructured to match omni-aws and omni-google patterns with omnistorage/ subdirectory" }
      ],
      "breaking": [
        { "description": "Move backend to `omnistorage/backend/` subdirectory to match other omni-* repos" },
        { "description": "Import path changed from `.../backend/github` to `.../omnistorage/backend/github`" }
      ],
      "upgradeGuide": [
        { "description": "Update import paths from `github.com/plexusone/omni-github/backend/github` to `github.com/plexusone/omni-github/omnistorage/backend/github`" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-04-25",
      "highlights": [
        { "description": "Restructured as root-level Go module for simpler imports" }
      ],
      "breaking": [
        { "description": "Move backend from `omnistorage/` to root directory", "commit": "bdb17fa" },
        { "description": "Module path changed from `github.com/plexusone/omni-github/omnistorage` to `github.com/plexusone/omni-github`", "commit": "f0a76bd" },
        { "description": "Import path changed from `.../omnistorage/backend/github` to `.../backend/github`", "commit": "bdb17fa" }
      ],
      "dependencies": [
        { "description": "`github.com/google/go-github/v84` v84.0.0 (was v82)", "commit": "7562c9e" }
      ],
      "documentation": [
        { "description": "Update README for root-level module with new import paths", "commit": "409dabe" },
        { "description": "Update README shields for plexusone organization", "commit": "0ecda67" },
        { "description": "Add icons to README features section", "commit": "3395edc" }
      ],
      "infrastructure": [
        { "description": "Update CI workflows for root-level module (remove working-directory)", "commit": "ba52b93" },
        { "description": "Rename workflows to use shared workflow naming", "commit": "09560fc" },
        { "description": "Update workflows to use shared workflow files", "commit": "8a0ba83" }
      ]
    },
    {
      "version": "v0.1.1",
      "date": "2026-01-17",
      "changed": [
        { "description": "Upgrade `go-github` from v68 to v81", "commit": "1cd5f90" },
        { "description": "Refactor path validation and normalization to use `gogithub/pathutil`", "commit": "1cd5f90" },
        { "description": "Refactor error translation to use `gogithub/errors`", "commit": "1cd5f90" }
      ],
      "dependencies": [
        { "description": "`github.com/google/go-github/v81` v81.0.0 (was v68)", "commit": "1cd5f90" },
        { "description": "`github.com/grokify/gogithub` v0.5.0 (new)", "commit": "1cd5f90" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-10",
      "highlights": [
        { "description": "Initial release with GitHub repository backend for OmniStorage" }
      ],
      "added": [
        { "description": "GitHub backend (`backend/github`) with `ExtendedBackend` implementation", "commit": "2aa33a0" },
        { "description": "Read files via GitHub Contents API", "commit": "2aa33a0" },
        { "description": "Write files with automatic commit creation", "commit": "2aa33a0" },
        { "description": "Batch commits via Git Trees and Commits API for atomic multi-file operations", "commit": "2aa33a0" },
        { "description": "Delete files with automatic commit creation", "commit": "2aa33a0" },
        { "description": "List files via GitHub Trees API with prefix filtering", "commit": "2aa33a0" },
        { "description": "File metadata (size, SHA1 hash) via Stat", "commit": "2aa33a0" },
        { "description": "Range read support (offset/limit)", "commit": "2aa33a0" },
        { "description": "Personal access token authentication", "commit": "2aa33a0" },
        { "description": "GitHub Enterprise support via custom BaseURL/UploadURL", "commit": "2aa33a0" },
        { "description": "Configurable commit messages with `{path}` placeholder", "commit": "2aa33a0" },
        { "description": "Configurable commit author (name and email)", "commit": "2aa33a0" },
        { "description": "Backend registry integration (`github` name)", "commit": "2aa33a0" },
        { "description": "Configuration from environment variables", "commit": "2aa33a0" },
        { "description": "Configuration from string maps", "commit": "2aa33a0" }
      ],
      "documentation": [
        { "description": "README.md with usage examples, batch API, and configuration reference", "commit": "81a6406" },
        { "description": "ROADMAP.md with planned features", "commit": "81a6406" },
        { "description": "GoDoc comments on all public APIs", "commit": "2aa33a0" }
      ],
      "tests": [
        { "description": "Unit tests for configuration parsing", "commit": "2aa33a0" },
        { "description": "Unit tests for path validation and normalization", "commit": "2aa33a0" },
        { "description": "Integration tests for backend operations (requires GITHUB_TOKEN)", "commit": "2aa33a0" }
      ]
    }
  ]
}
